Ran Plan for project: `simple-event-driven-architecture` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_policy.lambda_necessary_policies will be created
+ resource "aws_iam_policy" "lambda_necessary_policies" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "lambda_policies"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "textract:DetectDocumentText",
                          + "textract:StartDocumentTextDetection",
                          + "textract:StartDocumentAnalysis",
                          + "textract:AnalyzeDocument",
                          + "textract:GetDocumentTextDetection",
                          + "textract:GetDocumentAnalysis",
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "s3:*",
                          + "sqs:*",
                          + "ses:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_role.role_for_lambda will be created
+ resource "aws_iam_role" "role_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "role_for_lambda"
      + path                  = "/"
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.lambda-attach will be created
+ resource "aws_iam_role_policy_attachment" "lambda-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "role_for_lambda"
    }

  # aws_lambda_event_source_mapping.example will be created
+ resource "aws_lambda_event_source_mapping" "example" {
      + enabled                       = true
      + event_source_arn              = (known after apply)
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # aws_lambda_function.converter_func will be created
+ resource "aws_lambda_function" "converter_func" {
      + arn                            = (known after apply)
      + filename                       = "./scripts/lambda.zip"
      + function_name                  = "pic_to_text_converter"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "email_sender" = "John Doe <johndoe@outlook.com>"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_s3_bucket.bucket will be created
+ resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "images-hosting-for-test-2021"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket_notification.bucket_notification will be created
+ resource "aws_s3_bucket_notification" "bucket_notification" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + queue {
          + events        = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix = "images/"
          + id            = (known after apply)
          + queue_arn     = (known after apply)
        }
    }

  # aws_sqs_queue.dead_letter_queue_for_converter will be created
+ resource "aws_sqs_queue" "dead_letter_queue_for_converter" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "dead-letter-queue-for-converter"
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + visibility_timeout_seconds        = 60
    }

  # aws_sqs_queue.image_to_convert_queue will be created
+ resource "aws_sqs_queue" "image_to_convert_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "images-to-convert"
      + policy                            = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sqs:SendMessage",
                          + "sqs:DeleteMessage",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "*"
                      + Sid       = "Stmt1612168538544"
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      + receive_wait_time_seconds         = 0
      + redrive_policy                    = (known after apply)
      + visibility_timeout_seconds        = 240
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ s3_input_folder = "images/"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p simple-event-driven-architecture`
* :put_litter_in_its_place: To **delete** this plan click [here](http://8ad4a757ec9b:8080/lock?id=MaxKavun%252Fsimple-event-driven-architecture%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p simple-event-driven-architecture`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
